In [8]:
data_path = './data'
out_path = './output'

# 데이터 프레임
데이터가 크다!
    - 행이 많다 -> 컴퓨터가 느려짐 -> 고사양 장비 구축
    - 열이 많다 -> 분석 방법의 한계 -> 고급 분석 방법

## 1 데이터 프레임 만들기 - 시험 성적 데이터 만들기

### 데이터 입력해 데이터 프레임 만들기

In [9]:
import pandas as pd
df = pd.DataFrame({'name' : ['김지훈', '이유진', '박동현', '김민지'],
                   'english' : [90,80,60,70],
                   'math' : [50,60,100,20]})
df

  name  english  math
0  김지훈       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     4 non-null      object
 1   english  4 non-null      int64
 2   math     4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

### 특정 변수의 값 추출하기

In [11]:
df['english']

0    90
1    80
2    60
3    70
Name: english, dtype: int64

#### 합계

In [12]:
sum(df['english'])
sum(df['math'])

230

#### 평균

In [13]:
# 영어점수의 평균
sum(df['english'])/4

75.0

In [14]:
# 수학점수의 평균
sum(df['math'])/4

57.5

In [15]:
score = [80,60,70,50,90]
score

[80, 60, 70, 50, 90]

In [16]:
sum(score)

350

In [17]:
sum_score = sum(score)
sum_score

350

In [18]:
df2 = pd.DataFrame({'제품' : ['사과', '딸기', '수박'],
                    '가격' : [1800,1500,3000],
                    '판매량' : [24,38,13]})
df2

   제품    가격  판매량
0  사과  1800   24
1  딸기  1500   38
2  수박  3000   13

In [19]:
# 가격 평균
price_avg = sum(df2['가격'])/3
price_avg

2100.0

In [20]:
# 판매량 평균
volume_avg = sum(df2['판매량'])/3
volume_avg

25.0

In [21]:
# 가격 평균
price_avg = sum(df2['가격'])//3
price_avg

2100

In [22]:
# 판매량 평균
volume_avg = sum(df2['판매량'])//3
volume_avg

25

## 2 외부데이터 이용하기

### 엑셀 파일 불러오기

In [23]:
# 엑셀 파일을 불러와 df_exam에 할당(상대경로 사용)
df_exam = pd.read_excel(data_path+'/excel_exam.xlsx')
df_exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [24]:
# 엑셀 파일을 불러와 df_exam에 할당(경로 직접 사용)
df_exam = pd.read_excel('C:/PythonProject/data/excel_exam.xlsx')
df_exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

### 영어 점수와 과학 점수의 전체 평균 구하기

### len() 이용해서 평균 구하기

In [25]:
math_avg = sum(df_exam['english'])/len(df_exam)
science_avg = sum(df_exam['science'])/len(df_exam)
print(math_avg)
print(science_avg)

84.9
59.45

In [26]:
x = [1,2,3,4,5]
x

[1, 2, 3, 4, 5]

In [27]:
len(x)

5

In [28]:
# 데이터 프레임의 행 개수 구하기
df = pd.DataFrame({'a' : [1,2,3],
                   'b' : [4,5,6]})
df

   a  b
0  1  4
1  2  5
2  3  6

In [29]:
len(df)

3

In [30]:
### 엑셀 파일의 첫번째 행이 변수명이 아니라면?
df_exam_novar = pd.read_excel(data_path+'/excel_exam_novar.xlsx')
df_exam_novar.head()

   1  1.1  50  98  50.1
0  2    1  60  97    60
1  3    2  25  80    65
2  4    2  50  89    98
3  5    3  20  98    15
4  6    3  50  98    45

In [31]:
# None : 없다.
df_exam_novar = pd.read_excel(data_path+'/excel_exam_novar.xlsx',header=None)
df_exam_novar.head()

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15

### 엑셀 파일에 시트가 여러 개 있다면??

In [32]:
# sheet2 시트의 데이터 불러오기
df_exam = pd.read_excel(data_path+'/excel_exam.xlsx', sheet_name= 'Sheet2')
df_exam.head()

   id-2  nclass-2  math-2  english-2  science-2
0     1         1      50         98         50
1     2         1      60         97         60
2     3         1      45         86         78
3     4         1      30         98         58
4     5         2      25         80         65

In [33]:
# sheet3 시트의 데이터 불러오기
df_exam = pd.read_excel(data_path+'/excel_exam.xlsx', sheet_name= 'Sheet3')
df_exam.head()

   id-3  nclass-3  math-3  english-3  science-3
0     1         1      50         98         50
1     2         1      60         97         60
2     3         1      45         86         78
3     4         1      30         98         58
4     5         2      25         80         65

In [34]:
# sheet3 시트의 데이터 불러오기(숫자를 0부터 센다는 점 유의)
df_exam = pd.read_excel(data_path+'/excel_exam.xlsx', sheet_name= 2)
df_exam.head()

   id-3  nclass-3  math-3  english-3  science-3
0     1         1      50         98         50
1     2         1      60         97         60
2     3         1      45         86         78
3     4         1      30         98         58
4     5         2      25         80         65

### csv 파일 불러오기

In [35]:
df_csv_exam = pd.read_csv(data_path+'/exam.csv')
df_csv_exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

### 데이터 프레임을 csv 파일로 저장하기

In [36]:
df_midterm = pd.DataFrame({'english' : [90,80,60,70],
                            'math' : [50,60,100,20],
                            'nclass' : [1,1,2,2]})
df_midterm

   english  math  nclass
0       90    50       1
1       80    60       1
2       60   100       2
3       70    20       2

In [38]:
df_midterm.to_csv(out_path+'/out_newdata.csv')

In [39]:
# 인덱스 생략 후 csv 파일 저장
df_midterm.to_csv(out_path+'/out_newdata.csv', index=False)